# Brewfile — Managed by `brew bundle`
# Install everything: brew bundle --file=~/projects/configurations/Brewfile

# ============================================================================
# CLI Tools — Development
# ============================================================================
brew "git"                    # Version control
brew "git-lfs"                # Git Large File Storage
brew "gh"                     # GitHub CLI
brew "nvm"                    # Node.js version manager
brew "pyenv"                  # Python version manager
brew "jq"                     # JSON processor
brew "ripgrep"                # Fast search (rg)
brew "fd"                     # Fast find alternative
brew "fzf"                    # Fuzzy finder
brew "git-delta"              # Better git diffs
brew "tree"                   # Directory tree view
brew "wget"                   # HTTP downloads

# ============================================================================
# CLI Tools — Shell & Productivity
# ============================================================================
brew "z"                      # Directory jumping (frecency)
brew "bat"                    # Cat with syntax highlighting
brew "eza"                    # Modern ls replacement
brew "tldr"                   # Simplified man pages
brew "starship"               # Cross-shell prompt (optional, see .zshrc)

# ============================================================================
# Fonts
# ============================================================================
cask "font-fira-code-nerd-font"      # Monospace with ligatures + icons
cask "font-jetbrains-mono-nerd-font" # Monospace alternative + icons
cask "font-inter"                    # UI/design font

# ============================================================================
# Apps — Development
# ============================================================================
cask "iterm2"                 # Terminal
# IDE is installed separately based on user preference (see SETUP.md Step 0)

# ============================================================================
# Apps — Design
# ============================================================================
cask "figma"                  # Design tool

# ============================================================================
# Apps — Productivity
# ============================================================================
cask "alfred"                 # Launcher / Spotlight replacement
cask "rectangle"              # Window management
cask "1password"              # Password manager
cask "slack"                  # Team chat
cask "arc"                    # Browser
cask "karabiner-elements"     # Keyboard customization

# ============================================================================
# Apps — Utilities
# ============================================================================
cask "appcleaner"             # Clean app uninstaller
cask "cleanshot"              # Screenshot tool
cask "qlmarkdown"             # Quick Look preview for Markdown
